TobiU94/iot_esp8266_wifi_controlled_fairy_lights/src/main.cpp
#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <ESP8266mDNS.h>
#include <WiFiManager.h>
#include "RelayController.h"
#include "LightWebServer.h"
#include "Esp8266Hal.h"
#include "OtaUpdater.h"
#include "ota_config.h"
#include "BuildInfo.h"

#include "Esp8266VersionSource.h"
#include "Esp8266FirmwareInstaller.h"
#include "Esp8266Clock.h"

MDNSResponder mdns;

BuildInfo buildInfo;
Esp8266VersionSource versionSource(OtaConfig::VERSION_URL);
Esp8266FirmwareInstaller firmwareInstaller;
Esp8266Clock systemClock; //  cannot use "clock"; Arduino.h has it's implementation, otherwise we encounter some name conflict

// instantiate the over-the-air (OTA) firmware update service
OtaUpdater otaUpdater(buildInfo,
                      OtaConfig::FIRMWARE_URL,
                      versionSource,
                      firmwareInstaller,
                      systemClock,
                      OTA_CHECK_INTERVAL_MS);

Esp8266Hal hal;
RelayController relay(hal, D1);

LightWebServer webServer(relay, otaUpdater, buildInfo);

void initializeNetwork()
{
    // WiFiManager: tries saved credentials first;
    // if none/failed, starts AP "FairyLight-Setup" so the user can configures
    // his WiFi via captive portal.
    // Credentials persist in flash across reboots.
    Serial.begin(115200);
    WiFiManager wifiManager;

    bool connected = wifiManager.autoConnect("FairyLight-Setup");

    if (!connected)
    {
        Serial.println("Failed to connect and timed out - restarting...");
        delay(3000);
        ESP.restart();
    }

    // upon successful connection
    Serial.print("Connected to ");
    Serial.println(WiFi.SSID());
    Serial.print("IP address: ");
    Serial.println(WiFi.localIP());

    // mDNS exposes the board at http://esp8266.local
    if (mdns.begin("esp8266", WiFi.localIP()))
    {
        Serial.println("MDNS responder started");
    }
}

void setup()
{

    initializeNetwork();

    relay.begin();

    webServer.begin();
    Serial.println("HTTP server started");
}

void loop()
{
    webServer.handleClient();
    mdns.update(); // required to keep mdns responsive

    // Check for OTA updated periodically
    otaUpdater.checkForUpdateIfDue();
}